{"pageProps":{"post":{"title":"February/March 2021 library updates","date":"2021-02-21T00:00:00.000Z","slug":"2021-zpl-february-march-updates","author":"zaklaus","content":"<p>Hey community!</p>\n<p>Today we are going to talk about few new and upcoming features to the <strong>zpl</strong> library:</p>\n<h2>TCC Compatibility</h2>\n<p>Just a small heads up, the <a href=\"https://bellard.org/tcc/\">https://bellard.org/tcc/</a> compiler is now partially compatible with <strong>zpl</strong>!</p>\n<p>Threading code is currently disabled, as the compiler does not support C11 features. zpl_rdtsc also has a limited support when used on ARM family, as tcc does not support inline assembly on ARM.</p>\n<h2>JSON Parser</h2>\n<p>The zpl's json parser finally got some updates. It now introduces a new API to easily compose new JSON documents.</p>\n<p>Original comment handling code was replaced in favor of much smaller and faster code and overall makes the parsing process very smooth.</p>\n<p>Based on our tests on Raspberry Pi 4B, a <strong>55mb</strong> JSON file can be parsed in approx. <strong>650ms</strong> time on optimized builds, with comment handling routine enabled (takes around 1.3 seconds on unoptimized builds).</p>\n<p>There's a plan to slowly rewrite and reduce the parser code to allow for more room for optimisations</p>\n<p>On the other side, tests on Apple M1 Chip and the new parser implementation has mind-blowing speed! It parsed the same 55mb JSON file as above ^ <strong>within 100ms</strong> time on optimized build with comment handling routine enabled.</p>\n<p>We don't know about you, but to us that sounds very fast! 🚀</p>\n<p>Also just for reference the file in question can be accessed using <a href=\"https://www.reddit.com/r/datasets/comments/1uyd0t/200000_jeopardy_questions_in_a_json_file/\">this link</a>.</p>\n<h2>Upcoming version 12.0.0</h2>\n<p>Quick update, ZPL 12.0.0 will be released soon and it contains a reworked JSON module, since today, comments are now handled internally as a part of the parsing process, this simplifies the API a lot as well.</p>\n<p>Based on my tests on Raspberry Pi 4B, we were able to parse the same 55mb JSON file from above in ~550ms time. The code is also much smaller and easier to read, it finally goes along with the new design we've chosen for zpl itself.</p>\n<p>More stats to come later! We could drop the time down to <strong>320ms</strong> by using a preallocated block of memory on Raspberry Pi 4B.</p>\n<p>We ran the same test on AMD Ryzen 7 3700X capable machine, optimized build took 95ms to parse the same test file!</p>\n"}},"__N_SSG":true}