{"pageProps":{"post":{"title":"Abstract Data Tree","date":"2021-04-22T17:54:00.000Z","slug":"2021-abstract-data-tree","author":"zaklaus","content":"<p>The <strong>13.1.0</strong> release of <a href=\"http://zpl.pw\">zpl</a> has arrived and we have some news to share!\nWe have primarily focused on rewriting our JSON5 module, which allows us to integrate new parsers more easily! Let's get into major changes:</p>\n<h2>The manual builder</h2>\n<p>ADT builder allows us to construct data structure trees that are format-agnostic and flexible. <code>zpl_adt_node</code> contains enough information to cover all parser needs, ensuring that we can export this data into any format zpl supports.</p>\n<p>We have also developed a few helper methods to make data layout design easier to work with, namely:</p>\n<ul>\n<li><code>zpl_adt_inset(parent, name, value)</code> that appends a new node into provided <code>parent</code> branch,</li>\n<li>or <code>zpl_adt_set(node, name, value)</code> that sets up our existing node with a value.</li>\n</ul>\n<p>We have extracted a few methods from the former JSON5 parser as well:</p>\n<ul>\n<li><code>zpl_adt_parse_number(node, text)</code> parses the text and populates the node with a full number analysis,</li>\n<li>and <code>zpl_adt_str_to_flt(node)</code> that does the same thing, but relies on existing <em>string</em> node data to analyze the number.</li>\n</ul>\n<h2>JSON5/SJSON parser</h2>\n<p>The primary reason behind the JSON5 refactor was to reduce code complexity and put reusable components into a shared module all parsers would benefit from.</p>\n<p>We have reworked the parser from the ground up to benefit from the new ADT builder API. The code has been reduced substantially, and it is much easier to follow the flow now.</p>\n<p>The constant data type has also been removed in favor of number-based constant values we've already used for <code>Infinity</code> or <code>NaN</code>.</p>\n<h2>CSV parser</h2>\n<p>A new addition to the parser (now a) family is the CSV support! It follows the <code>RFC 4180</code> standard and supports various commonly used features, such as string literals, headers, or custom delimiters.</p>\n<p>The data layout in ADT is simple. Per each column, we create an array node holding cells of a respective row. The following CSV data:</p>\n<pre><code class=\"language-csv\">foo, bar, baz\n1,   2,   3\n4,   5,   6\n</code></pre>\n<p>will be represented in memory as:</p>\n<pre><code class=\"language-jsx\">root = {\n  foo = [1, 4],\n  bar = [2, 5],\n  baz = [3, 6]\n}\n</code></pre>\n<p>or, if we import a header-less CSV collection, it would be an array of arrays:</p>\n<pre><code class=\"language-jsx\">root = [\n  [1, 4],\n  [2, 5],\n  [3, 6]\n]\n</code></pre>\n<h3>String literals</h3>\n<p>The CSV parser also supports string literals with escaped double-quotes. The following CSV data is valid:</p>\n<pre><code class=\"language-csv\">name, occupation\nJim Halpert, Salesman\n\"Michael Scott\", Regional Manager\n\"Dwight \"\"Danger?\"\" Schrute\", \"Assistant (to the) Regional Manager\"\n</code></pre>\n<p>The list of names would be populated as follows: <code>Jim Halpert</code>, <code>Michael Scott</code>, <code>Dwight \"Danger?\" Schrute</code>.</p>\n<h2>Build once, transform anywhere!</h2>\n<p>We can build our own data tree with the features above and export it to any format we desire (as long as zpl supports it).</p>\n<p>Say we import the CSV collection from above:</p>\n<pre><code class=\"language-csv\">foo, bar, baz\n1,   2,   3\n4,   5,   6\n</code></pre>\n<p>The same data can be directly exported into JSON5:</p>\n<pre><code class=\"language-json\">{\n  \"foo\": [1, 4],\n  \"bar\": [2, 5],\n  \"baz\": [3, 6]\n}\n</code></pre>\n<p>and vice versa!</p>\n<p>This opens up a lot of opportunities, like building custom native low-level data pipelines for ETL and transformations.</p>\n<h2>Plans</h2>\n<p>We plan to add support for more languages over time. The <strong>YAML</strong> and <strong>TOML</strong> languages are the ones we will focus on shortly. However, we're open to any suggestions or contributions to enhance our little parser library.</p>\n<p>Thanks for reading!</p>\n"}},"__N_SSG":true}